Revit 2026 API

# ImageExportOptions Methods

---

The ImageExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFileName | Gets the file name that will be produced when exporting a view to an image. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetViewsAndSheets | Gets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews. |
|  | IsValidFileName | Verify if File name is valid |
|  | IsValidForSaveToProjectAsImage | Verify if ImageExportOptions object is valid for calling saveToProjectAsImage |
|  | SetViewsAndSheets |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace